Tekla.Structures.Analysis.AnalysisLabel
The AnalysisLabel class contains information related to analysis labels.

Tekla.Structures.Analysis.AnalysisLabel._Prefix
The prefix of the analysis label.

Tekla.Structures.Analysis.AnalysisLabel._Number
The number of the analysis label.

Tekla.Structures.Analysis.AnalysisLabel.Prefix
The prefix of the analysis label.

Tekla.Structures.Analysis.AnalysisLabel.Number
The number of the analysis label.